token_water = '747b8d86-2591-4aa2-bd3e-b8d2cbe3660d'
token_geo = '4153bafb-b6be-4097-814d-653ade3ffac5'
msg_text = 'Сейчас на улице {}°C, но ощущается как {}°C. Ветер {}, {}м/с, порывами до {}м/с. {}.' \
           '{} ожидается T воздуха {}°C. Ветер {}, {}м/с, порывами до {}м/с. {}.' \
           '{} ожидается T воздуха {}°C. Ветер {}, {}м/с, порывами до {}м/с. {}.'
dict_wind_dir = {'nw': 'северо-западный',
                 'n': 'северный',
                 'ne': 'северо-восточный',
                 'e': 'восточный',
                 'se': 'юго-восточный',
                 's': 'южный',
                 'sw': 'юго-западный',
                 'w': 'западный',
                 'x': 'штиль'}
dict_condition = {'clear': 'Ясно',
                  'partly-cloudy': 'Малооблачно',
                  'cloudy': 'Облачно с прояснениями',
                  'overcast': 'Пасмурно',
                  'drizzle': 'Морось',
                  'rain': 'Дождь',
                  'light-rain': 'Небольшой дождь',
                  'moderate-rain': 'Умеренно сильный дождь',
                  'heavy-rain': 'Сильный дождь',
                  'continuous-heavy-rain': 'Длительный сильный дождь',
                  'showers': 'Ливень',
                  'wet-snow': 'Дождь со снегом',
                  'light-snow': 'Небольшой снег',
                  'snow': 'Снег',
                  'snow-showers': 'Снегопад',
                  'hail': 'Град',
                  'thunderstorm': 'Гроза',
                  'thunderstorm-with-rain': 'Дождь с грозой',
                  'thunderstorm-with-hail': 'Гроза с градом'}
times_of_day = {'утром': 'morning',
                'вечером': 'evening',
                'днем': 'day',
                'ночью': 'night'}
