msg_text = '''Сейчас на улице {}°C, но ощущается как {}°C. Ветер {}, {}м/с, порывами до {}м/с. {}. 
{} ожидается T воздуха {}°C. Ветер {}, {}м/с, порывами до {}м/с. {}. 
{} ожидается T воздуха {}°C. Ветер {}, {}м/с, порывами до {}м/с. {}.'''

msg_hello = 'Привет! Я твой помощник, который будет каждый день сообщать актуальную погоду на улице и ближайший ' \
            'прогноз. Тебе всего-лишь нужно указать город и время, в которое нужно присылать сообщение.\nНапиши город!'

msg_city = 'Напиши город!'

msg_time = 'Напиши время, в которое будет приходить сообщение, в формате "22:12"'

msg_complete = 'Замечательно! Жди прогноз в назначенное время!'

city_not_found = 'Город не найден.'

time_error = 'Укажи время в правильном формате, например "22:12"'

msg_bye = 'Работа бота остановлена. Для возобновления работы, введите команду "/start". Пока!'

msg_change_city = 'Город изменен.'

msg_change_time = 'Время изменено.'

msg_city_first = 'Укажи сначала город'

msg_help = '''Для начала работы бота требуется всего лишь следовать указаниям на экране. Работает бот только с городами России. Название городов следует вводить только на русском языке.
Для того, чтобы изменить город, отправьте сообщение в виде:
"Изменить город: <название города>"
Для изменения времени, в которое будет присылаться прогноз погоды, напишите сообщение в виде:
"Изменить время: <время в формате "22:12">"
Для прекращения работы бота, напишите команду "/stop"'''

dict_wind_dir = {'nw': 'северо-западный',
                 'n': 'северный',
                 'ne': 'северо-восточный',
                 'e': 'восточный',
                 'se': 'юго-восточный',
                 's': 'южный',
                 'sw': 'юго-западный',
                 'w': 'западный',
                 'c': 'отсутствует'}

dict_condition = {'clear': 'Ясно',
                  'partly-cloudy': 'Малооблачно',
                  'cloudy': 'Облачно с прояснениями',
                  'overcast': 'Пасмурно',
                  'drizzle': 'Морось',
                  'rain': 'Дождь',
                  'light-rain': 'Небольшой дождь',
                  'moderate-rain': 'Умеренно сильный дождь',
                  'heavy-rain': 'Сильный дождь',
                  'continuous-heavy-rain': 'Длительный сильный дождь',
                  'showers': 'Ливень',
                  'wet-snow': 'Дождь со снегом',
                  'light-snow': 'Небольшой снег',
                  'snow': 'Снег',
                  'snow-showers': 'Снегопад',
                  'hail': 'Град',
                  'thunderstorm': 'Гроза',
                  'thunderstorm-with-rain': 'Дождь с грозой',
                  'thunderstorm-with-hail': 'Гроза с градом'}

times_of_day = {'morning': 'Утром',
                'evening': 'Вечером',
                'day': 'Днём',
                'night': 'Ночью'}
